Белгипрозем_2017/src/InformationRegisters/РезультатыВыполненияПроцессовИЗадач/РезультатыВыполненияПроцессовИЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияПроцессовИЗадач</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>EnumRef.ВариантыВыполненияПроцессовИЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/РезультатыВыполненияПроцессовИЗадач/ManagerModule.bsl
// Записывает результат выполнения переданного объекта
Процедура ЗаписатьРезультатПоОбъекту(Объект, Результат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияПроцессовИЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Результат = Результат;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
